Revit 2027 API
GenericForm.GetVisibility Method
Gets the visibility for the generic form.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public FamilyElementVisibility GetVisibility()
Public Function GetVisibility As FamilyElementVisibility
public:
FamilyElementVisibility^ GetVisibility()
member GetVisibility : unit -> FamilyElementVisibility
Return Value
FamilyElementVisibility
A copy of visibility settings for the generic form.
See Also
Reference
GenericForm Class
Autodesk.Revit.DB Namespace